gordonthree/can-stm32f103-remote/src/main.cpp
#include <Arduino.h>
#include <stdio.h>

#ifdef STMNODE01
#include <STM32RTC.h>

#include <IWatchdog.h>
#include <stm32yyxx_ll_adc.h>
// canbus stuff
#include <STM32_CAN.h>
static CAN_message_t CAN_RX_msg;

/** Setup CAN1 interface using alternate pins. */
STM32_CAN can1( CAN1, ALT ); // RX_SIZE_64, TX_SIZE_16

#define CONSOLE Serial       /** Create an alias for the Serial peripheral.  */

/* Get the rtc object */
STM32RTC& rtc = STM32RTC::getInstance();

#elif TEENSY01
#include <Metro.h>
#include <FlexCAN.h>

Metro sysTimer = Metro(1);// milliseconds

FlexCAN teensycan1(250000, 0);
static CAN_message_t CAN_RX_msg;

#define CONSOLE Serial       /** Create an alias for the Serial peripheral, */


#elif
#define CONSOLE Serial       /** Create an alias for the Serial peripheral. */

#endif

#include <CRC32.h>


// my canbus stuff
#include <canbus_project.h>      /** Include canbus project header file. */
using namespace ByteConversion;  /** Include byte conversion functions. */


volatile uint8_t nodeIdArrSize      = 0;
volatile uint8_t featureMaskArrSize = 0;
volatile uint8_t introMsgCnt        = 0;
volatile uint8_t introMsgPtr        = 0;

/** STM32 internal temp sensor stuff. */ 
/** Values available in datasheet. */
#if defined(STM32C0xx)
#define CALX_TEMP 30
#else
#define CALX_TEMP 25
#endif

#if defined(STM32C0xx)
#define VTEMP      760
#define AVG_SLOPE 2530
#define VREFINT   1212
#elif defined(STM32F1xx)
#define VTEMP     1430
#define AVG_SLOPE 4300
#define VREFINT   1200
#elif defined(STM32F2xx) || defined(STM32F4xx)
#define VTEMP      760
#define AVG_SLOPE 2500
#define VREFINT   1210
#endif

#ifdef STM32 
#define LED_ON      0
#define LED_OFF     1

#elif TEENSY01
#define LED_BUILTIN 13
#define LED_ON      0
#define LED_OFF     1

#define CAN_MY_IFACE_TYPE BOX_MULTI_IO
static const uint8_t mySwitchCount = 0; // no switches
static const uint8_t mySensorCount = 3; // got sensors

static const uint8_t* myNodeFeatureMask = FEATURE_BOX_SW_6GANG_HIGH;


#endif

/* Analog read resolution */
#define LL_ADC_RESOLUTION LL_ADC_RESOLUTION_12B
#define ADC_RANGE 4096

float Temperature, V_Sense, V_Ref;
char TxBuffer[30];
uint16_t AD_RES[2];
#ifdef STM32
ADC_HandleTypeDef hadc1;
#endif

// 32-bit CRC calculation library
CRC32 crc;


// Interval:
uint16_t TRANSMIT_RATE_MS = 1000;
#define POLLING_RATE_MS 500


struct canNodeInfo nodeInfo;       // information on this node

unsigned long previousMillis = 0;  // will store last time a message was send

/**
 * @brief Read the unique hardware ID from the STM processor. Run it through CRC32 to create a 32-bit hash to use as the node id.
 * 
 * @param none
 * 
 * @return uint8_t 4-byte array containing a unique 32-bit value.
 * 
 */
uint8_t* getNodeID(){
  uint32_t UID[3];
  uint8_t *buf = (uint8_t*)malloc(sizeof(uint8_t) * NODE_ID_SIZE);  /** Create a buffer to store the array until it is returned. */
  if (buf == NULL) {
    return NULL;
  }

  #ifdef STMNODE01
  // get unique hardware id from HAL
  UID[0] = HAL_GetUIDw0();
  UID[1] = HAL_GetUIDw1();
  UID[2] = HAL_GetUIDw2();
  #endif
  // show the user
  // CONSOLE.printf("UID: %08x:%08x:%08x\n", UID[0], UID[1], UID[2]);

  // add UID values to CRC calculation library
  crc.add(UID[0]);
  crc.add(UID[1]);
  crc.add(UID[2]);

  // show the user
  // CONSOLE.printf("CRC %08x\n", crc.calc());

  // calculate 32-bit crc value from the uid
  int myCRC = crc.calc();

  // transfer those four bytes to myNodeID array
  buf[0] = (myCRC >> 24) & 0xFF; // get first byte of CRC
  buf[1] = (myCRC >> 16) & 0xFF; // get second byte of CRC
  buf[2] = (myCRC >> 8) & 0xFF;  // get third byte of CRC
  buf[3] = myCRC & 0xFF;         // get fourth byte of CRC

  return buf;
}



#ifndef TEENSY01
static int32_t readVref() {
#ifdef STM32U0xx
  /* On some devices Internal voltage reference calibration value not programmed
     during production and return 0xFFFF. See errata sheet. */
  if ((uint32_t)(*VREFINT_CAL_ADDR) == 0xFFFF) {
    return 3300U;
  }
#endif
#ifdef __LL_ADC_CALC_VREFANALOG_VOLTAGE
#ifdef STM32U5xx
  return (__LL_ADC_CALC_VREFANALOG_VOLTAGE(ADC1, analogRead(AVREF), LL_ADC_RESOLUTION));
#else
  return (__LL_ADC_CALC_VREFANALOG_VOLTAGE(analogRead(AVREF), LL_ADC_RESOLUTION));
#endif
#else
  return (VREFINT * ADC_RANGE / analogRead(AVREF)); // ADC sample to mV
#endif
}
#endif

#ifdef ATEMP
static int32_t readTempSensor(int32_t VRef) {
#ifdef __LL_ADC_CALC_TEMPERATURE
#ifdef STM32U5xx
  return (__LL_ADC_CALC_TEMPERATURE(ADC1, VRef, analogRead(ATEMP), LL_ADC_RESOLUTION));
#else
  return (__LL_ADC_CALC_TEMPERATURE(VRef, analogRead(ATEMP), LL_ADC_RESOLUTION));
#endif
#elif defined(__LL_ADC_CALC_TEMPERATURE_TYP_PARAMS)
  return (__LL_ADC_CALC_TEMPERATURE_TYP_PARAMS(AVG_SLOPE, VTEMP, CALX_TEMP, VRef, analogRead(ATEMP), LL_ADC_RESOLUTION));
#else
  return 0;
#endif
}
#endif

#ifndef TEENSY01
/**
 * @brief Reads the voltage from a specified analog pin.
 * 
 * @param VRef The reference voltage in millivolts.
 * @param pin The pin number from which to read the analog voltage.
 * 
 * @return int32_t The calculated voltage in millivolts.
 */
static int32_t readVoltage(int32_t VRef, uint32_t pin)
{
#ifdef STM32U5xx
  // Calculate voltage using STM32U5xx specific function
  return (__LL_ADC_CALC_DATA_TO_VOLTAGE(ADC1, VRef, analogRead(pin), LL_ADC_RESOLUTION));
#else
  // Calculate voltage using general function
  return (__LL_ADC_CALC_DATA_TO_VOLTAGE(VRef, analogRead(pin), LL_ADC_RESOLUTION));
#endif
}
#endif

/**
 * @brief Return the current epoch in seconds.
 * 
 * @details This function returns the current epoch in seconds since 1970-01-01 00:00:00 UTC.
 * 
 * @return uint32_t The current epoch in seconds.
 */
static uint32_t getEpoch() {
  #ifdef STM32
  // Get the current epoch from the internal RTC
  uint32_t epoch = rtc.getEpoch();
  #else
  // If this is not an STM32, return 0
  uint32_t epoch = 0;
  #endif

  return epoch;
}

/**
 * @brief Print a list of outputs (switches) and their attributes a console
 * 
 * @param nodeID (optional) On a control node, print outputs for a specific node 4-bytes uint8_t
**/
static void dumpSwitches(uint8_t* nodeID[NODE_ID_SIZE]=NULL) {
  CONSOLE.println("\n\n--------------------------------------------------------------------------\n");

  if (nodeID != NULL) {
    CONSOLE.println("Node output modules:\n\n");
    // TODO needs more code
  } else {
    CONSOLE.printf("Node %02x:%02x:%02x:%02x output modules:\n\n\n", nodeID[0], nodeID[1], nodeID[2], nodeID[3]);

    for (int i = 0; i < NODE_MOD_MAX_CNT; i++) {
      if ((nodeInfo.subModules->modType >= MODULE_OUTPUTS) &&           /** Print info for outputs that have been defined and. */
          (nodeInfo.subModules->modType <= (MODULE_OUTPUTS | 0x0F))) {  /** are in the proper message id range */

        CONSOLE.printf("Switch %d: Last Update: %d\n", i, nodeInfo.subModules[i].timestamp);
          
