gordonthree/can-stm32f103-remote/src/main.cpp
        CONSOLE.printf("State %d, Mode %d, Type %d, Feature Mask %02x:%02x\n",  
          nodeInfo.subModules[i].u8Value,
          nodeInfo.subModules[i].outMode,
          nodeInfo.subModules[i].modType,
          nodeInfo.subModules[i].featureMask[0],
          nodeInfo.subModules[i].featureMask[1]);
          
        CONSOLE.printf("pwmDuty %d, pwmFreq %d, blinkDelay %d, momPressDur %d, strobePat %d\n\n",
          nodeInfo.subModules[i].pwmDuty,
          nodeInfo.subModules[i].pwmFreq,
          nodeInfo.subModules[i].blinkDelay,
          nodeInfo.subModules[i].momPressDur,
          nodeInfo.subModules[i].strobePat);
      }
    }
  }
  CONSOLE.println("\n\nEnd of Outputs Report\n");
  CONSOLE.println("--------------------------------------------------------------------------\n\n");

}

static void send_message(const uint16_t msgID, const uint8_t *msgData, const uint8_t dlc) {
  CAN_message_t message;
  // static uint8_t dataBytes[] = {0, 0, 0, 0, 0, 0, 0, 0}; // initialize dataBytes array with 8 bytes of 0

  digitalWrite(LED_BUILTIN, LED_ON);

  #ifdef STMNODE01
  // Format message
  message.id             = msgID;                                      // set message ID
  message.flags.extended = STD;                                        // 0 = standard frame, 1 = extended frame
  message.flags.remote   = 0;                                          // 0 = data frame, 1 = remote frame
  message.len            = dlc;                                        // data length code (0-8 bytes)
  #elif TEENSY01
  // Format message
  message.id             = msgID;                                      // set message ID
  message.len            = dlc;                                        // data length code (0-8 bytes)
  #endif
  
  memcpy(message.buf, (const uint8_t*) msgData, dlc);                  // copy data to message data field 

  #ifdef STMNODE01
  // Queue message for transmission
  if (can1.write(message)) {  // send message to bus, true = wait for empty mailbox
    // successful write?
  #elif TEENSY01
  // Queue message for transmission
  if (teensycan1.write(message)) {  // send message to bus, true = wait for empty mailbox
    // successful write?

  #endif
  } else {
    CONSOLE.printf("ERR: Failed to queue message\n");
  }

  digitalWrite(LED_BUILTIN, LED_OFF);

}

static void rxSwMomDur(uint8_t *data) {
  static uint8_t switchID = data[4]; // switch ID 
  static uint16_t swDuration = (data[5] << 8) | data[6]; // duration in ms
  
  nodeInfo.subModules[switchID].momPressDur = swDuration; // update momentary press duration
}

static void rxSwBlinkDelay(uint8_t *data) {
  static uint8_t switchID = data[4]; // switch ID 
  static uint16_t swBlinkDelay = (data[5] << 8) | data[6]; // delay in ms 

  nodeInfo.subModules[switchID].blinkDelay = swBlinkDelay; // update blink delay
}

static void rxSwStrobePat(uint8_t *data) {
  static uint8_t switchID = data[4]; // switch ID 
  static uint8_t swStrobePat = data[5]; // strobe pattern

  nodeInfo.subModules[switchID].strobePat = swStrobePat; // update strobe pattern
}

static void rxPWMDuty(uint8_t *data) {
  static uint8_t switchID = data[4]; // switch ID 
  static uint16_t PWMDuty = (data[5] << 8) | data[6]; // pwm duty cycle

  nodeInfo.subModules[switchID].pwmDuty = PWMDuty; // update pwm duty cycle
}

static void rxPWMFreq(uint8_t *data) {
  static uint8_t switchID = data[4]; // switch ID 
  static uint16_t PWMFreq = (data[5] << 8) | data[6]; // pwm frequency 

  nodeInfo.subModules[switchID].pwmFreq = PWMFreq; // update pwm frequency
}

/**
 * @brief Handles the reception of an output state command and updates the attributes in the nodeInfo.
 *
 * @param data The received message data
 * @param outputState The output state value from the message data, default is 0xff
 */
static void rxOutputState(const uint8_t outputID, const uint8_t outputState = 0xff) {
  nodeInfo.subModules[outputID].u8Value = outputState; /** update switch state in nodeInfo */
  nodeInfo.subModules[outputID].timestamp = getEpochTime(); /** update timestamp in nodeInfo */
  
  /** TODO: implement output state handling */
  switch (outputState) {
    case OUT_STATE_DISABLED:      /** disabled output, ignore control commands */
      break;
    case OUT_STATE_OFF:           /** output is off */
      break;
    case OUT_STATE_ON:            /** output is on */
      break;
    case OUT_STATE_MOMENTARY:     /** output momentary press command */
      break;
    case OUT_STATE_BLINKING:      /** output is blinking */
      break;
    case OUT_STATE_STROBE:        /** output is strobing */
      break; 
    case OUT_STATE_PWM:           /** output is pwm */
      break;
    default:                      /** invalid output state */
      // CONSOLE.println("Invalid output state");
      break;
  }
}

/**
 * @brief Handles the reception of an output mode command and updates the attributes in the nodeInfo.
 * 
 * This function processes the incoming data to set the mode of a specified output 
 * on the node. It updates the output mode in the subModules structure and records 
 * the current time as a timestamp. The function also includes a switch-case statement 
 * for implementing specific mode handling based on the mode received.
 * 
 * @param data A pointer to an array containing the message data, where:
 *             - data[4] represents the output ID.
 *             - data[5] represents the output mode.
 */

static void rxOutputMode(const uint8_t *data) {
  uint8_t outputID   = data[4]; /** output ID */
  uint8_t outputMode = data[5]; /** output mode */

  nodeInfo.subModules[outputID].u8Value = switchMode; /** update output mode in nodeInfo */
  nodeInfo.subModules[switchID].timestamp = getEpochTime(); /** update timestamp */


  /** TODO: implement mode handling */
  switch (outputMode) {
    case OUT_MODE_ALWAYS_OFF: /** Output control disabled and output is always off */
      break;  
    case OUT_MODE_ALWAYS_ON:  /** Output control disabled and output is always on */
      break;
    case OUT_MODE_TOGGLE:     /** Output acts like an on/off toggle switch */
      break;
    case OUT_MODE_MOMENTARY:  /** Output acts like a momentary push switch */
      break;
    case OUT_MODE_BLINKING:   /** Output blinks on and off like a turn signal */
      break;
    case OUT_MODE_STROBE:     /** Output strobes various timing patterns */
      break;
    case OUT_MODE_PWM:        /** Output uses a PWM signal */
      break;
    default:                  /** Invalid output mode */
      // CONSOLE.println("Invalid output mode");
      break;
  }
}


// send an introduction message to the bus
// static void txIntroduction(const uint8_t* txNodeID, const uint8_t* txNodeFeatureMask, const uint_8t txMsgData, const uint16_t txmsgID, const uint8_t ptr) {
/**
 * @brief Introduce this node and modules to the entire net
 * 
 * @param ptr optional pointer for where we are in the introductions. leave blank to only send the node intro message
 */
static void txIntroduction(int ptr = -1) {

