gordonthree/can-stm32f103-remote/src/main.cpp
  if ( ptr <= 0) {  /**  Step one introduce the node itself, then move onto modules below. */
    uint16_t txMsgID = nodeInfo.nodeType;
    CONSOLE.printf("TX: NODE INTRO TYPE %03x PTR %i\n", txMsgID, ptr );  /** Tell the user some things. */
    uint8_t* dataBytes = messageBuilder(nodeInfo.nodeID, nodeIdArrSize, nodeInfo.featureMask, featureMaskArrSize);

    send_message(nodeInfo.nodeType, dataBytes, sizeof(dataBytes));  // send this data to the tx queue
  }
  
  if (ptr > 0) {                                                                /** Remaining introduction steps. */
    uint8_t modPtr = (ptr - 1);                                                 /** Reduce pointer by 1 so we start at beginning of the submodules array. */
    uint16_t txMsgID = nodeInfo.subModules[modPtr].modType;                     /** Retrieve module type. */

    if (txMsgID > 0) {                                                          /** Only proceed if the module is defined. */
      CONSOLE.printf("TX: MODULE INTRO TYPE %03x PTR %i\n", txMsgID, modPtr);    /** Tell the user some things. */
      if (nodeInfo.subModules[modPtr].sendFeatureMask) {                        /**  This module requires the feature mask to be sent with the introduction. */
        uint8_t* dataBytes = messageBuilder(nodeInfo.nodeID, nodeIdArrSize, nodeInfo.subModules[ptr].featureMask, featureMaskArrSize);
        send_message(txMsgID, dataBytes, sizeof(dataBytes));                    /** Send this data to the tx queue. */
      } else {                                                                  /** No feature mask is available, send a module count. */
        uint8_t txFeatureMask[] = {nodeInfo.subModules[ptr].modCount, 0};       /** Create a basic feature mask with the count for this module type. */
        uint8_t* dataBytes = messageBuilder(nodeInfo.nodeID, nodeIdArrSize, txFeatureMask, featureMaskArrSize);
        send_message(txMsgID, dataBytes, sizeof(dataBytes));                    /** Send this data to the tx queue. */
      }
    }
  }
}

static void nodeCheckStatus() {
  if (FLAG_SEND_INTRODUCTION) {
    // send introduction message to all nodes
    txIntroduction(introMsgPtr);
    CONSOLE.printf("TX: INTRO MSG %d OF %d\n", introMsgPtr, introMsgCnt);

    if (introMsgPtr >= introMsgCnt) {
      FLAG_SEND_INTRODUCTION = false; // clear flag to send introduction message
      // FLAG_BEGIN_NORMAL_OPER = true; // set flag to begin normal operation 
    }
  }

  if (!FLAG_BEGIN_NORMAL_OPER) {
    return; // normal operation not started, exit function
  }

  for (uint8_t i = 0; i < NODE_MOD_MAX_CNT; i++) {                        /** Step through the submodules. */
    /** lets do outputs first */
    if ((nodeInfo.subModules[i].modType >= MODULE_OUTPUTS) &&              /** Print info for outputs that have been defined and */
        (nodeInfo.subModules[i].modType <= (MODULE_OUTPUTS | 0x0F))) {     /** are in the proper message id range. */
      uint8_t swState     = nodeInfo.subModules[i].u8Value;  /**  get output state */
      uint8_t swMode      = nodeInfo.subModules[i].outMode;  /**  get output mode */
      uint8_t modeData[]  = {nodeInfo.nodeID[0], nodeInfo.nodeID[1], nodeInfo.nodeID[2], nodeInfo.nodeID[3], i, swMode};  // send my node ID, along with the switch number
      uint8_t stateData[] = {nodeInfo.nodeID[0], nodeInfo.nodeID[1], nodeInfo.nodeID[2], nodeInfo.nodeID[3], i, swState}; // send my node ID, along with the switch number
        
      send_message(DATA_OUTPUT_SWITCH_MODE,  modeData,  sizeof(modeData));  /** send output mode data */
      send_message(DATA_OUTPUT_SWITCH_STATE, stateData, sizeof(stateData)); /** send output state data */
    } else
    
    /** now lets do sensors1 and sensors2 */
    if ((nodeInfo.subModules[i].modType >= MODULE_SENSORS1) &&                          /** Print info for sensors that have been defined and */
        (nodeInfo.subModules[i].modType <= (MODULE_SENSORS1 | 0x0F)) ||                 /** are in the proper message id range. */
        (nodeInfo.subModules[i].modType >= MODULE_SENSORS2) &&                          
        (nodeInfo.subModules[i].modType <= (MODULE_SENSORS2 | 0x0F))) {                 
          bool privMsg     = nodeInfo.subModules[i].privMsg;                            /** check if sensor uses private channel to send data */
          uint16_t txMsgID = nodeInfo.subModules[i].txMsgID;                            /** get message ID for this sensor */
          if (privMsg) {                                                                /** sensor has a private channel, sending more than four bytes of data */
            char *buf = (char *)malloc(sizeof(char) * CAN_MAX_DLC);                     /** create a buffer to hold the data. */
            sprintf(buf, "%d", nodeInfo.subModules[i].i32Value);                        /** convert signed integer to c-string */
            send_message(txMsgID, (uint8_t*) buf, CAN_MAX_DLC);                         /** send message with ID assigned by controller */
          } else {                                                                      /** assemble data to send based on a smaller sensor value */
            uint8_t sensorValue[2] = {0};
            chunk16((uint16_t) nodeInfo.subModules[i].i32Value, sensorValue);           /** convert integer to byte array */
            uint8_t* dataBytes = messageBuilder(nodeInfo.nodeID, nodeIdArrSize, sensorValue, sizeof(sensorValue) / sizeof(sensorValue[0])); /** Aassemble byte array to send with message. */
            send_message(nodeInfo.subModules[i].txMsgID, dataBytes, nodeInfo.subModules[i].dataSize); /** send message to standard message ID with the node ID and sensor data */
          }
    } 
  } /** end for */
 
} /** end nodeCheckStatus */

static void handle_rx_message(CAN_message_t &message) {
  bool msgFlag = false;
  bool haveRXID = false; 
  // int msgIDComp;
  
  uint8_t* myNodeID = nodeInfo.nodeID;
  uint16_t msgID = message.id;
  uint8_t rxNodeID[NODE_ID_SIZE] = {0, 0, 0, 0}; // node ID

  digitalWrite(LED_BUILTIN, LED_ON);

 
