gordonthree/can-stm32f103-remote/src/main.cpp
  if (d == "C0"){
    // vTaskSuspend(canbus_task_handle); // suspend canbus task
    // digitalWrite(LED, HIGH);
  }
  if (d == "C1"){
    // vTaskResume(canbus_task_handle); // resume canbus task
    // digitalWrite(LED, HIGH);
  }
  if (d == "W"){
    // printWifi();
    // digitalWrite(LED, HIGH);
  }

  if (d == "LOAD"){
    // vTaskSuspend(canbus_task_handle); // suspend canbus task
    loadJSONConfig();
    // vTaskSuspend(canbus_task_handle); // suspend canbus task
    // digitalWrite(LED, HIGH);
  }

  if (d == "TIME"){
    // printEpoch();
    // digitalWrite(LED, HIGH);
  }

  if (d == "FAST"){
   TRANSMIT_RATE_MS = 1000;
    CONSOLE.printf("\nTX Rate: %d ms\n", TRANSMIT_RATE_MS);
    // digitalWrite(LED, HIGH); 
  }

  if (d == "FSTR"){
    TRANSMIT_RATE_MS = TRANSMIT_RATE_MS - 250;
     CONSOLE.printf("\nTX Rate: %d ms\n", TRANSMIT_RATE_MS);
     // digitalWrite(LED, HIGH); 
   }

  if (d == "SLOW"){
    TRANSMIT_RATE_MS = 4000;
    CONSOLE.printf("\nTX Rate: %d ms\n", TRANSMIT_RATE_MS);
    // digitalWrite(LED, HIGH); 
  }


  if (d == "RESTART"){
    CONSOLE.println("Restarting...");
    // ESP.restart();
    // digitalWrite(LED, HIGH);
  }

  if (d == "NODEID"){
    CONSOLE.print("Node ID: ");
    for (int i = 0; i < NODE_ID_SIZE; i++) CONSOLE.printf("%02x:", nodeInfo.nodeID[i]); // Print the node ID in hex format with colons between each byte
    CONSOLE.println(); // Print a newline character

  }
    
  if (d=="LIST"){
    dumpSwitches();
    // dumpNodeList();
    // digitalWrite(LED, LOW);
  }
  if (d == "ON"){
    FLAG_BEGIN_NORMAL_OPER = true; // flag to start normal operation
  }
  if (d=="OFF"){
    FLAG_BEGIN_NORMAL_OPER = false; // clear flag for normal operation
  }
}




void setup() {
  #ifdef STMNODE01 // TODO how do we automate this?

  nodeInfo.nodeType  = BOX_MULTI_IO;
  nodeInfo.subModCnt = 3;
  nodeInfo.featureMask[0] = 0;
  nodeInfo.featureMask[1] = 0;

  nodeInfo.subModules[0].modType = NODE_INT_VOLTAGE_SENSOR;
  nodeInfo.subModules[0].txMsgID = DATA_INTERNAL_PCB_VOLTS;
  nodeInfo.subModules[0].modCount = 1;
  nodeInfo.subModules[0].sendFeatureMask = false;
  nodeInfo.subModules[0].dataSize   = DATA_SIZE_16BITS;
  nodeInfo.subModules[0].privMsg = false;

  nodeInfo.subModules[1].modType = NODE_CPU_TEMP;
  nodeInfo.subModules[1].txMsgID  = DATA_NODE_CPU_TEMP;
  nodeInfo.subModules[1].modCount = 1;
  nodeInfo.subModules[1].sendFeatureMask = false;
  nodeInfo.subModules[1].dataSize   = DATA_SIZE_16BITS;
  nodeInfo.subModules[1].privMsg = false;

  nodeInfo.subModules[2].modType = BUTTON_ANALOG_KNOB;
  nodeInfo.subModules[2].txMsgID  = SENSOR_RESERVED_72C;
  nodeInfo.subModules[2].modCount = 1;
  nodeInfo.subModules[2].sendFeatureMask = false;
  nodeInfo.subModules[2].dataSize   = DATA_SIZE_16BITS;
  nodeInfo.subModules[2].privMsg = false;

  introMsgCnt = nodeInfo.subModCnt + 1; /** number of intro messages */
  introMsgPtr = 0; // start at zero
    
  rtc.begin(); // initialize RTC 24H format

  #elif STMNODE02
  nodeInfo.nodeType  = BOX_SW_4GANG;
  nodeInfo.subModCnt = 2;
  
  uint8_t* buf = (uint8_t*)FEATURE_BOX_SW_4GANG;
  nodeInfo.featureMask[0] = buf[0];
  nodeInfo.featureMask[1] = buf[1];
  nodeInfo.subModCnt = 2;

  nodeInfo.subModules[0].modType = OUT_HIGH_CURRENT_SW; // intro message for high current switch
  nodeInfo.subModules[0].txMsgID = DATA_OUTPUT_SWITCH_STATE;
  nodeInfo.subModules[0].modCount = 2;
  nodeInfo.subModules[0].sendFeatureMask = false;
  nodeInfo.subModules[0].dataSize   = DATA_SIZE_8BITS;
  nodeInfo.subModules[0].privMsg = false;

  nodeInfo.subModules[1].modType = OUT_LOW_CURRENT_SW; // intro message for low current switch
  nodeInfo.subModules[1].txMsgID = DATA_OUTPUT_SWITCH_STATE;
  nodeInfo.subModules[1].modCount = 2;
  nodeInfo.subModules[1].sendFeatureMask = false;
  nodeInfo.subModules[1].dataSize   = DATA_SIZE_8BITS;
  nodeInfo.subModules[1].privMsg = false;
  #endif

  // these should be constants, but volatile works instead
  nodeIdArrSize      = sizeof(nodeInfo.nodeID) / sizeof(nodeInfo.nodeID[0]);
  featureMaskArrSize = sizeof(nodeInfo.featureMask) / sizeof(nodeInfo.featureMask[0]);


#ifndef TEENSY01
  // setup hardware timer to send data in 50Hz pace
#if defined(TIM1)
  TIM_TypeDef *Instance = TIM1;
#else
  TIM_TypeDef *Instance = TIM2;
#endif
  HardwareTimer *SendTimer = new HardwareTimer(Instance);
  SendTimer->setOverflow(1, HERTZ_FORMAT); // 50 Hz
#if ( STM32_CORE_VERSION_MAJOR < 2 )
  SendTimer->attachInterrupt(1, SendData);
  SendTimer->setMode(1, TIMER_OUTPUT_COMPARE);
#else //2.0 forward
  SendTimer->attachInterrupt(nodeCheckStatus);
#endif
#endif

  analogReadResolution(12);

  pinMode(LED_BUILTIN, OUTPUT); // blue pill LED
  CONSOLE.begin(256000);
  delay(5000);
  #ifdef STMNODE01
  can1.begin(); // begin CAN bus with no auto retransmission
  can1.setBaudRate(250000);  //250KBPS
  // can1.setMBFilter(ACCEPT_ALL); // accept all messages
  // can1.enableLoopBack(false); // disable loopback mode
  // can1.enableFIFO(false); // enable FIFO mode

  can1.setMBFilterProcessing( MB0, MSG_CTRL_SWITCHES, MASK_BITS_11_TO_8, STD ); // 0x780 watch the four MSB of the ID 
  can1.setMBFilterProcessing( MB1, MSG_REQ_INTRO, MASK_BITS_11_TO_8, STD );

  uint8_t* myNodeID = getNodeID();                 /** Get nodeID from unique hardware id. */
  for (uint8_t i = 0; i < sizeof(myNodeID); i++) { /** Copy temporary array into the struct. */
    nodeInfo.nodeID[i] = myNodeID[i];
  }

  FLAG_SEND_INTRODUCTION = true;
  SendTimer->resume();
  #elif TEENSY01
  teensycan1.begin();
  CAN_filter_t myFilter = {.id = (MSG_CTRL_IFACE<<21) | (MASK_CTRL_IFACE <<5)};
  

  //teensycan1.setFilter()
  #endif


} // end setup

int lastPending = 0;
uint32_t last = 0;
int lastMillis = 0;


void loop() {


  if ((millis() - lastMillis) > TRANSMIT_RATE_MS) {
    lastMillis = millis();
    // CONSOLE.print(".");
    // digitalToggle(LED_BUILTIN); // toggle LED
    
    nodeCheckStatus(); // handle node status
    
    #ifdef STMNODE01
    // Print out the value read
    int32_t VRef = readVref();                       // get the voltage reference value
    nodeInfo.subModules[0].i32Value = VRef;                   // store vref reading
    nodeInfo.subModules[1].i32Value = readTempSensor(VRef);   // store cpu temp reading
    nodeInfo.subModules[2].i32Value = readVoltage(VRef, A0);  // store value of analog 0
    #endif
  }

  #ifdef STMNODE01
  while (can1.read(CAN_RX_msg) ) {
    // CONSOLE.printf("RX: MSG: %03x DATA: %u\n", CAN_RX_msg.id, CAN_RX_msg.len);
    handle_rx_message(CAN_RX_msg); // handle received message}
  }
  #endif

} // end of loop